In [1]:
import numpy as np
import pandas as pd

In [2]:
sky = ['Q','X','Z']
my_list = [10,20,30]
arr = np.array([100,200,300])
d = {'a':10,'b':20,'c':30}
r = {"Name":["Karan1","Karan2","Karan3"],"Age":[20,21,22]}
labels = [sky,my_list,arr,d]
type(labels)

list

In [3]:
print(pd.Series(labels))
print()
print(pd.DataFrame(labels))

0                      [Q, X, Z]
1                   [10, 20, 30]
2                [100, 200, 300]
3    {'a': 10, 'b': 20, 'c': 30}
dtype: object

     0    1    2
0    Q    X    Z
1   10   20   30
2  100  200  300
3    a    b    c

In [4]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.DataFrame(d,index=[0])

    a   b   c
0  10  20  30

In [6]:
pd.DataFrame(r)

     Name  Age
0  Karan1   20
1  Karan2   21
2  Karan3   22

In [7]:
print(sky)

['Q', 'X', 'Z']

In [8]:
pd.Series(sky,index = arr)

100    Q
200    X
300    Z
dtype: object

In [9]:
pd.Series(sky,index = my_list)

10    Q
20    X
30    Z
dtype: object

In [10]:
pd.Series(sky,index = d)

a    Q
b    X
c    Z
dtype: object

# ** NumPy Arrays **

In [11]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [12]:
pd.Series(arr,index = sky)

Q    100
X    200
Z    300
dtype: int32

In [13]:
d1={"Name":["John","Joseph","Sunny","Honey"],"Age":[27,28,29,45],"Salary":[100,150,200,250]}
pd.DataFrame(d1)

     Name  Age  Salary
0    John   27     100
1  Joseph   28     150
2   Sunny   29     200
3   Honey   45     250

In [14]:
pd.Series(d1)

Name      [John, Joseph, Sunny, Honey]
Age                   [27, 28, 29, 45]
Salary            [100, 150, 200, 250]
dtype: object

# Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [15]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','Italy', 'Japan'])
ser2 = pd.Series([1,2,5,4],index = ['Italy', 'Germany','USA', 'Japan'])
print(ser1,ser2,sep='\n\n')

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

Italy      1
Germany    2
USA        5
Japan      4
dtype: int64

In [16]:
ser2.rename(index = {'USA':'IND','Japan':'ARG'},inplace=True)
ser2

Italy      1
Germany    2
IND        5
ARG        4
dtype: int64

In [17]:
ser1 = ser1.rename({'USA':'IND'})
ser1

IND        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [18]:
ser1+ser2

ARG        NaN
Germany    4.0
IND        6.0
Italy      4.0
Japan      NaN
dtype: float64

In [19]:
ser1-ser2

ARG        NaN
Germany    0.0
IND       -4.0
Italy      2.0
Japan      NaN
dtype: float64

In [20]:
ser1/ser2

ARG        NaN
Germany    1.0
IND        0.2
Italy      3.0
Japan      NaN
dtype: float64

In [21]:
ser1*ser2

ARG        NaN
Germany    4.0
IND        5.0
Italy      3.0
Japan      NaN
dtype: float64